{
  "kind": "build_request",
  "title": "Switch to classic (non-cursive) typography and remove all meme content + extra prompt line",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-10",
      "text": "Switch the UI typography to a classic (non-cursive) font across the app by removing usage of the `font-cursive` styling on headings (proposal screen and celebration screen) and the letter modal title, and ensure all visible text renders in a standard non-cursive font style.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "write on classic font not in cursive"
        ]
      },
      "acceptanceCriteria": [
        "On the proposal screen, the main header \"Will you be my Valentine zia?\" does not render in a cursive/script font.",
        "On the celebration screen, the headline \"YAYYAYYY I KNEW YOU'D SAY YES ILOVEYOUSMM\" does not render in a cursive/script font.",
        "In the letter modal, the title \"A Letter For You\" does not render in a cursive/script font.",
        "No other UI elements use the `.font-cursive` utility to render cursive text."
      ]
    },
    {
      "id": "REQ-11",
      "text": "Remove the proposal-screen line of text \"I have something special to ask you... 💕\" so it is no longer displayed anywhere in the question state UI.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "remove i have something special to ask you"
        ]
      },
      "acceptanceCriteria": [
        "The proposal screen no longer shows the text \"I have something special to ask you...\" (including the heart emoji).",
        "The rest of the proposal screen layout (question header and Yes/No buttons) remains functional and visually centered."
      ]
    },
    {
      "id": "REQ-12",
      "text": "Remove all meme content from the celebration screen, including the couple-cats meme image and any visible \"MWAAHH/MWAAHHH\" meme text, so the celebration state contains no meme image and no \"MWAAHH\" line.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "remove previous and new meme two cats kissing each  MWAAAHH MWAAAHH meme"
        ]
      },
      "acceptanceCriteria": [
        "In the celebration state, there is no image element rendering the meme asset (e.g., `/assets/generated/valentine-meme-cats.dim_1200x1200.png`).",
        "In the celebration state, the text line \"MWAAHHH MWAAHHH 💋💋\" is not displayed (and no other \"MWAAHH\" meme text is shown).",
        "The celebration state still shows the celebratory headline \"YAYYAYYY I KNEW YOU'D SAY YES ILOVEYOUSMM\" and still provides an \"Open Letter\" button that opens the existing letter modal."
      ]
    }
  ],
  "constraints": [
    "Frontend only; do not add or require backend changes (backend/main.mo should remain unused for this request).",
    "Do not edit files under `frontend/src/components/ui` or any other paths listed as immutable in SYSTEM_CONTEXT.",
    "Keep user-facing text in English."
  ],
  "nonGoals": [
    "Do not add new meme images or replacement celebration images.",
    "Do not change the Valentine question text \"Will you be my Valentine zia?\".",
    "Do not remove the evasive behavior of the \"No\" button.",
    "Do not change the love letter content text in `frontend/src/content/valentineLetter.ts`."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}