{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Remove cursive typography and meme content from Valentine UI",
  "requirements": [
    {
      "id": "REQ-10",
      "summary": "Switch the app typography to classic (non-cursive) by removing all uses of the font-cursive utility on headings and the letter modal title.",
      "acceptanceCriteria": [
        "On the proposal screen, the main header \"Will you be my Valentine zia?\" does not render in a cursive/script font.",
        "On the celebration screen, the headline \"YAYYAYYY I KNEW YOU'D SAY YES ILOVEYOUSMM\" does not render in a cursive/script font.",
        "In the letter modal, the title \"A Letter For You\" does not render in a cursive/script font.",
        "No other UI elements use the `.font-cursive` utility to render cursive text."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Remove the `font-cursive` class from the proposal screen main header and the celebration screen headline so headings use the standard (non-cursive) font."
        },
        {
          "path": "frontend/src/components/LetterModal.tsx",
          "operation": "modify",
          "description": "Remove the `font-cursive` class from the DialogTitle so the letter modal title uses the standard (non-cursive) font."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Remove (or neutralize) the custom `.font-cursive` utility definition to ensure no UI can render cursive text via that utility."
        }
      ]
    },
    {
      "id": "REQ-11",
      "summary": "Remove the extra proposal-screen prompt line so it is not displayed in the question state UI.",
      "acceptanceCriteria": [
        "The proposal screen no longer shows the text \"I have something special to ask you...\" (including the heart emoji).",
        "The rest of the proposal screen layout (question header and Yes/No buttons) remains functional and visually centered."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Delete the proposal-screen paragraph that renders \"I have something special to ask you... 💕\" while preserving the existing centered layout and button behavior."
        }
      ]
    },
    {
      "id": "REQ-12",
      "summary": "Remove all meme content from the celebration screen while keeping the headline and Open Letter modal flow intact.",
      "acceptanceCriteria": [
        "In the celebration state, there is no image element rendering the meme asset (e.g., `/assets/generated/valentine-meme-cats.dim_1200x1200.png`).",
        "In the celebration state, the text line \"MWAAHHH MWAAHHH 💋💋\" is not displayed (and no other \"MWAAHH\" meme text is shown).",
        "The celebration state still shows the celebratory headline \"YAYYAYYY I KNEW YOU'D SAY YES ILOVEYOUSMM\" and still provides an \"Open Letter\" button that opens the existing letter modal."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Remove the celebration-screen meme image element referencing `/assets/generated/valentine-meme-cats.dim_1200x1200.png` and remove the visible \"MWAAHHH MWAAHHH 💋💋\" line, keeping the headline and the \"Open Letter\" button behavior unchanged."
        }
      ]
    }
  ]
}